from .symbols import STRESS


IOTATION_MAP = {
    
    'я': 'а', 
    'ю': 'у', 
    'є': 'е'
    
    }


CODA_MAP = {

    'в': 'ў', 
    'й': 'ĭ'
    
}


VOICE_PAIRS_MAP = {

    "п": "б",                                                              
    "т": "д",
    "тʹ": "дʹ",
    "с": "з",
    "сʹ": "зʹ",
    "ц": "ӡ",
    "цʹ": "ӡʹ",
    "ш": "ж",
    "ч": "Ԫ",
    "к": "ґ",
    "х": "г"

}

SOFT_PAIRS_MAP = {

    "д": "дʹ",                                                              
    "т": "тʹ",
    "з": "зʹ",
    "с": "сʹ",
    "ӡ": "ӡʹ",
    "ц": "цʹ",
    "л": "лʹ",
    "н": "нʹ",
    "р": "рʹ",

}


ARTICULATION_PAIRS_MAP = {

    'dental_to_affricates_whistling' : {
        'д': 'ӡ',
        'т': 'ц',
        'дʹ': 'ӡʹ',
        'тʹ': 'цʹ'
    },

    'dental_to_affricates_hushing' : {
        'д': 'Ԫ',
        'т': 'ч',
        'дʹ': 'Ԫ',
        'тʹ': 'ч'
    },

    'sibilants_whistling_to_hushing': {
        'з': 'ж',
        'с': 'ш',
        'ӡ': 'Ԫ',
        'ц': 'ч',
        'зʹ': 'ж',
        'сʹ': 'ш',
        'ӡʹ': 'Ԫ',
        'цʹ': 'ч',
    },

    'sibilants_hushing_to_whistling': {
        'ж': 'з',
        'ш': 'с',
        'Ԫ': 'ӡ',
        'ч': 'ц',
    }

}


NASALIZATION_MAP = {

        'а': 'ã', 'о': 'õ', 
        'у': 'ỹ', 'е': 'ẽ', 
        'и': 'ũ', 'і': 'ĩ'

    }


DEVOICE_EXCEPTIONS = {

    'кігт':'кіхт', 'нігт':'ніхт',
    'легк':'лехк', 'вогк':'вохк',
    'дьогт':'дьохт', 'дігт':'діхт'

}


REFLEXIVE_ASSIMILATION = {

    'ться': 'цця'

}


TSK_RULES = {

    r'нтськ': 'нськ',
    rf'([аеєиіїоуюя]{STRESS}?)тськ': r'\1цьк'

}
